#+TITLE: Week 1 Notebook
#+Author: Bryan Muller
#+LANGUAGE:en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty

*** 1.
#+begin_src python :results output
substrings_s = { "a" * i + "b" * j + "c" * k for i in range(2) for j in range(2) for k in range(2) }
print(substrings_s)
#+end_src

#+RESULTS:
: set(['', 'a', 'c', 'b', 'abc', 'bc', 'ac', 'ab'])

#+begin_src elisp :results raw
(-flatten (loop for i from 0 to 1
      collect (loop for j from 0 to 1
          collect (loop for k from 0 to 1
              collect (concat (make-string i ?a) (make-string j ?b) (make-string k ?c))))))
#+end_src

#+RESULTS:
( c b bc a ac ab abc)

*** 2.

#+begin_src python :results output
print({"(" * i + ")" * j for i in range(6) for j in range(6) if i == j})
#+end_src

#+RESULTS:
: set(['', '(())', '((()))', '()', '((((()))))', '(((())))'])

#+begin_src elisp :results raw
(-flatten
    (loop for i from 0 to 5
        collect (loop for j from 0 to 5
            if (= i j)
            collect (concat (make-string i ?\() (make-string j ?\)))))))

#+end_src

#+RESULTS:
( () (()) ((())) (((()))) ((((())))))

*** 3.

#+begin_src python :results output
p = "abcde"
q = "fghij"

print((p+q)[::-1])
print(q[::-1] + p[::-1])
#+end_src

#+RESULTS:
: 14
: jihgfedcba
: jihgfedcba

On the left side of the equation, we are adding the strings /p/ and /q/ and then
reversing that concatenated string. On the right side of the equation, we are
reversing the strings /p/ and /q/ and then adding them together. This works due
to the commutative property of reverse function. In integer arithmetic, we can
see this same property like so.

Given an three integers /a/, /b/, and /c/:
 (a + b)(c) = (a * c) + (b * c)


#+begin_src python :results output
a = 5
b = 3
c = 2

print((a+b)*(c))
print((a * c) + (b * c))
#+end_src

#+RESULTS:
: 16
: 16

*** DONE 3.
    CLOSED: [2019-01-15 Tue 16:10]
    #+begin_src elisp :results silent
(defun l-1 (n)
   (-flatten
      (loop for i from 0 to n
            collect (loop for j from 0 to n
                       if (= i j)
                       collect (concat (make-string i ?\() (make-string j ?\))))))))
#+end_src

#+BEGIN_SRC elisp
(l-1 3)
#+END_SRC

#+RESULTS:
|   | () | (()) | ((())) |

    a. \epsilon, '()', '(())'
    b. '()()()'
    c. '()'.
       We previously established that L_1 \sub L_2 \sub L_3,
       so we would need to take the smallest member of L_1. We could
       go with \epsilon, but that seemed a little too much of a given :)

